### Операции приведения типов
##### Числа
С точки зрения языка все операции ниже это не математически операции,
а операции приведения типов, когда мы из двух типов получаем один.

Тип данных - это то, что хранится в переменной, например число, строка, булево значение и т.д.
1, 2, 1.2, 'Hello', True - это примеры значений разных типов.


```python
# Приведение двух целых чисел к целому числу
print(1 + 5)
print(2 - 5)
print(2 * 5)

# Приведение двух целых чисел к вещественному числу
print(10 / 2)

# Приведение двух вещественных чисел к вещественному числу
print(1.0 + 5.0)
print(2.0 - 5.0)
print(2.0 * 5.0)
print(2.0 / 5.0)

# Приведение целого числа и вещественного числа к вещественному числу
print(1 + 5.0)
```

Чтобы узнать какой тип в итоге получится, можно использовать функцию type
```python
print(type(10 / 2))  # теперь принт выведет не само число а его тип
```

Сравнение двух чисел в пайтон так же считается операцией приведения типов
с точки зрения языка
```python
# Ниже мы два целых числа приводим/превращаем в bool
print(1 == 1)  # True
print(1 == 2)  # False
print(1 == 1.0)  # True

print(1 != 3)  # True
print(1 != 1)  # False

print(1 > 2)  # False
print(1 < 2)  # True

print(1 >= 1)  # True
print(1 <= 1)  # True
```
То же самое можно делать с вещественными числами
```python
print(1.0 == 1.0)  # True
print(1.0 > 3)  # Здесь мы сравниваем вещественное число с целым и получает True
```

Слева или справа могут быть выражения
```python
print(1 + 1 == 2)  # True
print(23 * 2 + 1 == 22 + 11)  # False
```

##### Строки
Похожие операции доступны и для строк
```python
# Приведение двух строк к строке
print('Hello' + 'World')
# Сравнение двух строк
print('Hello' == 'Hello')  # True
print('Hello' == 'World')  # False
```

Что-то чуть сложнее, скажи что выдаст следующий код
```python
print('Hello' + 'World' != "HelloWorld")
```

Строки можно сравнивать с числами
```python
print('Hello' == 1)  # False
```
Но смысла это имеет мало, результат всегда False
При этом прибавить число к строку нельзя
```python
print('Hello' + 1)  # TypeError: can only concatenate str (not "int") to str
```

##### Булевы значения
```python
# Приведение двух булевых значений к булевому значению
print(True == True)  # True
print(True == False)  # False
```

В пайтон не принято сравнивать булевы значения друг с другом через ==, лучше использовать is
```python
print(True == False)  # Не принято хоть и работает
print(True is False)  # Лучше делать вот так
```
is - это операция сравнения ссылок, что переменные указывают на одну и ту же ячейку памяти
== - это операция сравнения значений, что переменные хранят одинаковые значения, но могут быть в разных ячейках памяти

True и False всегда храняться в одной и той же ячейке памяти, поэтому используют is вместо ==
Пока просто запомните это, потом мы отдельно это изучать будем

or, and, not - это тоже операции приведения типов
```python
True or False  # True
True and False  # False
not True  # False
not False  # True
```
Ты могла изучать их как логические операции на информатике в школе.
Их отдельно потом посмотрим, я здесь чисто для конспекта добавил

##### None
None - это специальное значение, которое означает отсутствие значения
```python
None
```

Если твоя функция ничего не возвращает (нет return), то на самом деле она возвращает None

```python
def func():
    print('Hello')

result = func()
print(result)  # None

def func():
    print('Hello')
    return 1

result = func()
print(result)  # 1
```


### ДЗ
- Написать программу в которой есть функция, которая принимает два числа и сравнивает их,
  если первое число больше второго, то возвращает True, иначе False
  После этого функцию нужно запустить с числа 129 и 130 а так же с числами -11 и 19
- Написать функцию которая делит два числа, написать функцию которая вычитает из первого числа второе
  Запустить первую функцию с числами 10 и 2, вторую с числами 10 и 2, переменожить результаты двух функций.
  Что-то вроде этого только с использованием функций: (10 / 2) * (10 - 2)
- Функция sum() принимает два числа и возвращает их сумму. Взгляните на код ниже. Какое число будет выведено на экран?
  Это задание со звездочкой
  ```python
  def sum(a, b):
      return a + b

  result = sum(sum(1, 3), sum(sum(4, 2), 3))
  print(result)  # ?
  ```
